app/controllers/posts_controller.rb

      def create
        @post = Post.new(params[:post])

        flash[:notice] = 'Post was successfully created.' if @post.save
---
INSERT INTO "posts" ("body", "created_at", "excerpt", "title", "updated_at") VALUES (?, ?, ?, ?, ?)